# Data Type Conversion

Notebook to convert the numerical datatypes in 2 csv's to integer

In [66]:
import pandas as pd

In [67]:
prop24 = pd.read_csv('data/final/property24.csv')
rent_ke = pd.read_csv('data/final/rent_ke_final.csv')

## Brief peek on the datasets

In [68]:
prop24.head()

,Location,City,Bedrooms,Bathrooms,Parking,Price
0,South B,Nairobi,1,1,NaN,KSh 25 000
1,Karen,Nairobi,3,2,Erf Size:\n\n 0.5\n...,KSh 280 000
2,Rosslyn,Nairobi,2,2,NaN,KSh 170 000
3,Syokimau,Nairobi,2,2,2,KSh 28 000
4,Kileleshwa,Nairobi,3,3,NaN,KSh 150 000

the dataset has 4 numerical columns `Bedrooms, Bathrooms, Parking and Price`

In [69]:
prop24.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211995 entries, 0 to 211994
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Location   188149 non-null  object
 1   City       188149 non-null  object
 2   Bedrooms   208776 non-null  object
 3   Bathrooms  204590 non-null  object
 4   Parking    123037 non-null  object
 5   Price      211995 non-null  object
dtypes: object(6)
memory usage: 9.7+ MB

looking at the overview of the columns and their datatypes

Currently, all the columns are objects which is not entirely what we want since some columns hold numerical values

Let's conver them to integer types

In [70]:
# let's look at the unique numbers of the bedrooms in houses
prop24['Bedrooms'].value_counts()

3                                                                                                              56751
4                                                                                                              50267
2                                                                                                              41705
5                                                                                                              38179
1                                                                                                              13777
                                                                                                               ...
Floor Size:\n\r\n                            294\r\n                        \r\n                        m²         1
Erf Size:\n\r\n                            199.27\r\n                        \r\n                        m²        1
Erf Size:\n\r\n                            692.13\r\n                        \r\n                        m²        1
Floor Size:\n\r\n                            47\r\n                        \r\n                        m²          1
Erf Size:\n\r\n                            30\r\n                        \r\n                        m²            1
Name: Bedrooms, Length: 1009, dtype: int64

We have somewhat inconsistent data, this comes with the fact the data was scrapped and sometime irrelevant data was captured.
However, this should not worry us, we'll use `pd.to_numeric` pandas method that converts non-numeric data to `NaN`, thus we'll get rid of the data

In [71]:
prop24['Bedrooms'] = pd.to_numeric(prop24['Bedrooms'], 'coerce')

In [72]:
prop24.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211995 entries, 0 to 211994
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Location   188149 non-null  object
 1   City       188149 non-null  object
 2   Bedrooms   206572 non-null  float64
 3   Bathrooms  204590 non-null  object
 4   Parking    123037 non-null  object
 5   Price      211995 non-null  object
dtypes: float64(1), object(5)
memory usage: 9.7+ MB

well well, what do we have here? We've converted the column `Bedrooms` to float64 datatype. We've converted the columns to a numeric datatype but that's not really the type we want, we want the column to be of the type `int64`.
Let's now convert the type to the data type then using the `astype method`

In [73]:
prop24['Bedrooms'] = prop24['Bedrooms'].round().astype('Int64')

In [74]:
prop24.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211995 entries, 0 to 211994
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Location   188149 non-null  object
 1   City       188149 non-null  object
 2   Bedrooms   206572 non-null  Int64
 3   Bathrooms  204590 non-null  object
 4   Parking    123037 non-null  object
 5   Price      211995 non-null  object
dtypes: Int64(1), object(5)
memory usage: 9.9+ MB

Magic right, but do we have to repeat the same process for every column/dataset, nope, a function would come in handy

In [75]:
def covert_to_int(data: pd.DataFrame, col_list):
    for col in col_list:
        try:
            data[col] = strip_comma(data, col) # stri[ comma
        except:
            pass
        try:
            data[col] = convert_to_numeric(data, col) # convert from object to float64 dtype
        except:
            pass
        try:      
            data[col] = data[col].round().astype('Int64')
        except:
            pass       
    return data

def strip_comma(data: pd.DataFrame, col_name):
    data[col_name] = data[col_name].str.replace(',', '')
    return data

def convert_to_numeric(data: pd.DataFrame, col_name):
    data[col_name] = pd.to_numeric(data[col_name], 'coerce')
    return data

In [76]:
prop24.head()

,Location,City,Bedrooms,Bathrooms,Parking,Price
0,South B,Nairobi,1,1,NaN,KSh 25 000
1,Karen,Nairobi,3,2,Erf Size:\n\n 0.5\n...,KSh 280 000
2,Rosslyn,Nairobi,2,2,NaN,KSh 170 000
3,Syokimau,Nairobi,2,2,2,KSh 28 000
4,Kileleshwa,Nairobi,3,3,NaN,KSh 150 000

In [77]:
prop24['Price'] = prop24['Price'].str.replace('KSh ', '')
prop24['Price'] = prop24['Price'].str.replace(' ', '')

In [78]:
prop24.head()

,Location,City,Bedrooms,Bathrooms,Parking,Price
0,South B,Nairobi,1,1,NaN,25000
1,Karen,Nairobi,3,2,Erf Size:\n\n 0.5\n...,280000
2,Rosslyn,Nairobi,2,2,NaN,170000
3,Syokimau,Nairobi,2,2,2,28000
4,Kileleshwa,Nairobi,3,3,NaN,150000

In [79]:
columns = ['Bedrooms', 'Bathrooms', 'Parking', 'Price']
prop_24_new = covert_to_int(prop24, columns)

In [80]:
prop_24_new.head()

      Location      City  Bedrooms  Bathrooms  Parking   Price
0      South B   Nairobi         1          1     <NA>   25000
1        Karen   Nairobi         3          2     <NA>  280000
2      Rosslyn   Nairobi         2          2     <NA>  170000
3     Syokimau   Nairobi         2          2        2   28000
4   Kileleshwa   Nairobi         3          3     <NA>  150000

In [81]:
prop_24_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211995 entries, 0 to 211994
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Location   188149 non-null  object
 1   City       188149 non-null  object
 2   Bedrooms   206572 non-null  Int64
 3   Bathrooms  203646 non-null  Int64
 4   Parking    103158 non-null  Int64
 5   Price      211900 non-null  Int64
dtypes: Int64(4), object(2)
memory usage: 10.5+ MB

Hurray, we are done with propert_24 dataset, 
Next is rent_ke dataset, just calling the function

In [82]:
rent_ke.head()

     Price  Bedrooms  Bathrooms     City          Location
0  155,000       4.0        4.0  Nairobi  General Mathenge
1  100,000       3.0        4.0  Nairobi          Kilimani
2   75,000       3.0        5.0  Nairobi         Lavington
3  135,000       3.0        4.0  Nairobi          Kilimani
4   50,000       3.0        NaN  Nairobi       Imara Daima

In [83]:
rent_ke.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1848 entries, 0 to 1847
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1848 non-null   object
 1   Bedrooms   1845 non-null   float64
 2   Bathrooms  1557 non-null   float64
 3   City       1848 non-null   object
 4   Location   1848 non-null   object
dtypes: float64(2), object(3)
memory usage: 72.3+ KB

In [84]:
columns = ['Bedrooms', 'Bathrooms', 'Price']

In [85]:
rent_ke_new = covert_to_int(rent_ke, columns)

In [86]:
rent_ke_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1848 entries, 0 to 1847
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1848 non-null   Int64
 1   Bedrooms   1845 non-null   Int64
 2   Bathrooms  1557 non-null   Int64
 3   City       1848 non-null   object
 4   Location   1848 non-null   object
dtypes: Int64(3), object(2)
memory usage: 77.7+ KB

Hurray, we're done with that, let's now save them as a csv file

In [87]:
rent_ke_new.head()

    Price  Bedrooms  Bathrooms     City          Location
0  155000         4          4  Nairobi  General Mathenge
1  100000         3          4  Nairobi          Kilimani
2   75000         3          5  Nairobi         Lavington
3  135000         3          4  Nairobi          Kilimani
4   50000         3       <NA>  Nairobi       Imara Daima

In [88]:
rent_ke_new.to_csv('data/data_final/rent_ke.csv', index=False)
prop_24_new.to_csv('data/data_final/property24.csv', index=False)